import type { SpecialistProfile } from "../types/specialist";
import photo from '../assets/images/specialist-photo.png'

export const SPECIALIST_MOCK: SpecialistProfile = {
    id: 'specialist-1',
    name: 'Катерина Ковальська',
    photo,
    isVerified: true,
    experienceYears: 8,
    sessionMinutes: 50,
    price: 2500,
    approaches: ['Гештальт-терапія', 'КПТ'],
    about: 'Вітаю! Я практикуючий психолог. Допомагаю відновити внутрішню опору, подолати тривожність та навчитися краще розуміти свої емоції в безпечному та бережному просторі.',
    education: [
        'Диплом магістра психології (КНУ ім. Т. Шевченка, 2018)',
        'Сертифікована програма: «Когнітивно-поведінкова терапія депресивних та тривожних розладів»',
        'Сертифікована програма: «Гештальт-підхід у консультуванні»',
    ],
    topics: ['anxiety', 'burnout', 'depression', 'selfEsteem', 'relationships'],
    topicDescriptions: [
        'Тривожні стани, панічні атаки, постійне відчуття напруги',
        'Емоційне вигорання, втрата мотивації та хронічна втома',
        'Депресивний настрій, апатія, втрата радості',
        'Складнощі у стосунках, встановлення особистих кордонів',
        'Низька самооцінка, синдром самозванця, невпевненість у собі',
    ],
}